>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9 VALUE 7.
01 B PIC 9 VALUE 4.

PROCEDURE DIVISION.
    DISPLAY A
    IF A = 7
        DISPLAY "True"
    ELSE
        DISPLAY "False"
    END-IF
    IF B < 5
        DISPLAY "True"
    ELSE
        DISPLAY "False"
    END-IF
    STOP RUN.
