>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 N PIC 9 VALUE 0.

PROCEDURE DIVISION.
    COMPUTE N = 1
    DISPLAY N
    COMPUTE N = 2
    DISPLAY N
    COMPUTE N = 3
    DISPLAY N
    STOP RUN.
