>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMS PIC X(6) VALUE "[1, 2]".

PROCEDURE DIVISION.
    COMPUTE NUMS = 3
    DISPLAY NUMS(1 + 1:1 + 1 - 1)
    STOP RUN.
