>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMS PIC X(9) VALUE "[1, 2, 3]".

PROCEDURE DIVISION.
    DISPLAY "True"
    DISPLAY "False"
    STOP RUN.
