>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMS PIC X(9) VALUE "[3, 1, 4]".

PROCEDURE DIVISION.
    DISPLAY 1
    DISPLAY 4
    STOP RUN.
