>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S PIC X(5) VALUE "catch".

PROCEDURE DIVISION.
    DISPLAY "cat"
    DISPLAY "dog"
    STOP RUN.
