>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

PROCEDURE DIVISION.
    DISPLAY FUNCTION CONCATENATE("hello ", "world")
    STOP RUN.
