>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (1.0µs)"
    DISPLAY "   test example 2                      ... ok (195ns)"
    DISPLAY "   test example 3                      ... ok (591ns)"
    DISPLAY "   test zero                           ... ok (308ns)"
    STOP RUN.
