>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (322ns)"
    DISPLAY "   test example 2                      ... ok (178ns)"
    DISPLAY "   test example 3                      ... ok (146ns)"
    DISPLAY "   test overflow                       ... ok (179ns)"
    STOP RUN.
