>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (1.0µs)"
    DISPLAY "   test example 2                      ... ok (375ns)"
    DISPLAY "   test example 3                      ... ok (470ns)"
    DISPLAY "   test empty string                   ... ok (94ns)"
    STOP RUN.
