>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (6.0µs)"
    DISPLAY "   test example 2                      ... ok (4.0µs)"
    DISPLAY "   test single row                     ... ok (139ns)"
    STOP RUN.
