>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC X(6) VALUE "[1, 2]".

PROCEDURE DIVISION.
    DISPLAY "[1, 2, 3]"
    STOP RUN.
