>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9 VALUE 7.
01 B PIC 9 VALUE 4.
01 TMP PIC S9(9) VALUE 0.

PROCEDURE DIVISION.
    DISPLAY A
    IF A = 7
        DISPLAY "true"
    ELSE
        DISPLAY "false"
    END-IF
    IF B < 5
        DISPLAY "true"
    ELSE
        DISPLAY "false"
    END-IF
    STOP RUN.
