>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

PROCEDURE DIVISION.
    DISPLAY 7
    DISPLAY 9
    DISPLAY 7
    DISPLAY 8
    STOP RUN.
