>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 TMP PIC S9(9) VALUE 0.

PROCEDURE DIVISION.
    COMPUTE TMP = 1 + 2 * 3
    DISPLAY TMP
    COMPUTE TMP = (1 + 2) * 3
    DISPLAY TMP
    COMPUTE TMP = 2 * 3 + 1
    DISPLAY TMP
    COMPUTE TMP = 2 * (3 + 1)
    DISPLAY TMP
    STOP RUN.
