>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

PROCEDURE DIVISION.
    DISPLAY "--- People grouped by city ---"
    DISPLAY "Paris : count = 3 , avg_age = 55"
    DISPLAY "Hanoi : count = 3 , avg_age = 27.333333333333332"
    STOP RUN.
