>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 XS PIC X(9) VALUE "[1, 2, 3]".

PROCEDURE DIVISION.
    DISPLAY "true"
    DISPLAY 1
    STOP RUN.
