>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 TMP PIC S9(9) VALUE 0.

PROCEDURE DIVISION.
    COMPUTE TMP = FUNCTION LENGTH("mochi")
    DISPLAY TMP
    STOP RUN.
