>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 XS PIC X(12) VALUE "[10, 20, 30]".

PROCEDURE DIVISION.
    DISPLAY 20
    STOP RUN.
