>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 S PIC X(5) VALUE "mochi".

PROCEDURE DIVISION.
    DISPLAY FUNCTION CONCATENATE("'", S(1 + 1:1 + 1 - 1), "'")
    STOP RUN.
