>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 STR1 PIC X(5) VALUE "mochi".

PROCEDURE DIVISION.
    DISPLAY STR1(1 + 1:4 - 1)
    STOP RUN.
