>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 TMP PIC S9(9) VALUE 0.

PROCEDURE DIVISION.
    DISPLAY -3
    COMPUTE TMP = 5 + -2
    DISPLAY TMP
    STOP RUN.
