>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (2.0µs)"
    DISPLAY "   test example 2                      ... ok (2.0µs)"
    DISPLAY "   test empty first                    ... ok (243ns)"
    DISPLAY "   test empty second                   ... ok (221ns)"
    STOP RUN.
