       IDENTIFICATION DIVISION.
       PROGRAM-ID. BASIC-COMPARE.
       PROCEDURE DIVISION.
           DISPLAY 7.
           DISPLAY "true".
           DISPLAY "true".
           STOP RUN.
