       IDENTIFICATION DIVISION.
       PROGRAM-ID. BINARY-PRECEDENCE.
       PROCEDURE DIVISION.
           DISPLAY 7.
           DISPLAY 9.
           DISPLAY 7.
           DISPLAY 8.
           STOP RUN.
