       IDENTIFICATION DIVISION.
       PROGRAM-ID. BOOL-CHAIN.
       PROCEDURE DIVISION.
           DISPLAY "true".
           DISPLAY "false".
           DISPLAY "false".
           STOP RUN.
