       IDENTIFICATION DIVISION.
       PROGRAM-ID. BREAK-CONTINUE.
       PROCEDURE DIVISION.
           DISPLAY "odd number: 1".
           DISPLAY "odd number: 3".
           DISPLAY "odd number: 5".
           DISPLAY "odd number: 7".
           STOP RUN.
