       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAST-STRUCT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TODO.
          05 TITLE PIC X(20) VALUE "hi".
       PROCEDURE DIVISION.
           DISPLAY TITLE
           STOP RUN.
