       IDENTIFICATION DIVISION.
       PROGRAM-ID. FOR-LOOP.
       PROCEDURE DIVISION.
           DISPLAY 1.
           DISPLAY 2.
           DISPLAY 3.
           DISPLAY 4.
           STOP RUN.
