       IDENTIFICATION DIVISION.
       PROGRAM-ID. IN-OPERATOR.
       PROCEDURE DIVISION.
           DISPLAY "true".
           DISPLAY "true".
           STOP RUN.
