       IDENTIFICATION DIVISION.
       PROGRAM-ID. LIST-SET-OPS.
       PROCEDURE DIVISION.
           DISPLAY "1 2 3".
           DISPLAY "1 3".
           DISPLAY 2.
           DISPLAY 4.
           STOP RUN.
