       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAP-IN-OPERATOR.
       PROCEDURE DIVISION.
           DISPLAY "true".
           DISPLAY "false".
           STOP RUN.
