       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAP-MEMBERSHIP.
       PROCEDURE DIVISION.
           DISPLAY "true".
           DISPLAY "false".
           STOP RUN.
