       IDENTIFICATION DIVISION.
       PROGRAM-ID. VALUES-BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 V1 PIC 9 VALUE 1.
       01 V2 PIC 9 VALUE 2.
       01 V3 PIC 9 VALUE 3.
       PROCEDURE DIVISION.
           DISPLAY V1 V2 V3
           STOP RUN.
