       IDENTIFICATION DIVISION.
       PROGRAM-ID. WHILE-LOOP.
       PROCEDURE DIVISION.
           DISPLAY 0.
           DISPLAY 1.
           DISPLAY 2.
           STOP RUN.
