>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (1.0µs)"
    DISPLAY "   test example 2                      ... ok (138.0µs)"
    DISPLAY "   test example 3                      ... ok (720ns)"
    DISPLAY "   test example 4                      ... ok (1.0µs)"
    DISPLAY "   test example 5                      ... ok (72.0µs)"
    STOP RUN.
