       IDENTIFICATION DIVISION.
       PROGRAM-ID. APPEND-BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY 1 2 3
       STOP RUN.
