       IDENTIFICATION DIVISION.
       PROGRAM-ID. AVG_BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY 2
       STOP RUN.
