       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAST_STRING_TO_INT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY FUNCTION NUMVAL("1995")
       STOP RUN.
