       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAST-STRING-TO-INT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       COMPUTE TMP = FUNCTION NUMVAL("1995")
       DISPLAY TMP
       STOP RUN.
