       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAST-STRUCT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TODO.
           05 TITLE-V PIC X(2) VALUE "hi".
       PROCEDURE DIVISION.
       DISPLAY TITLE-V
       STOP RUN.
