       IDENTIFICATION DIVISION.
       PROGRAM-ID. COUNT_BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY 3
       STOP RUN.
