       IDENTIFICATION DIVISION.
       PROGRAM-ID. FOR-LIST-COLLECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 N PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       PERFORM VARYING N FROM 1 BY 1 UNTIL N > 3
           DISPLAY N
       END-PERFORM
       STOP RUN.
