       IDENTIFICATION DIVISION.
       PROGRAM-ID. FOR_MAP_COLLECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 K PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       MOVE "a" TO K
       DISPLAY K
       MOVE "b" TO K
       DISPLAY K
       STOP RUN.
