       IDENTIFICATION DIVISION.
       PROGRAM-ID. IN_OPERATOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       COMPUTE TMP = (2 >= 1 AND 2 <= 3)
       DISPLAY TMP
       COMPUTE TMP = ! ((5 >= 1 AND 5 <= 3))
       DISPLAY TMP
       STOP RUN.
