       IDENTIFICATION DIVISION.
       PROGRAM-ID. JSON-BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       PERFORM FN_JSON USING M
       FN_JSON_RES
       STOP RUN.
