       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEN_MAP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY 2
       STOP RUN.
