       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEN-MAP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY 2
       STOP RUN.
