       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEN_STRING.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY 5
       STOP RUN.
