       IDENTIFICATION DIVISION.
       PROGRAM-ID. LIST_INDEX.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY 20
       STOP RUN.
