       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAP-IN-OPERATOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       COMPUTE TMP = (1 = 1 OR 1 = 2)
       DISPLAY TMP
       COMPUTE TMP = (3 = 1 OR 3 = 2)
       DISPLAY TMP
       STOP RUN.
