       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAP-NESTED-ASSIGN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 DATA.
           05 OUTER-INNER PIC 9 VALUE 1.
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       COMPUTE DATA-OUTER-INNER = 2
       COMPUTE TMP = DATA-OUTER-INNER
       DISPLAY TMP
       STOP RUN.
