       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAP-INT-KEY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY "a"
       STOP RUN.
