       IDENTIFICATION DIVISION.
       PROGRAM-ID. MATH_OPS.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY 6 * 7
       DISPLAY 7 / 2
       DISPLAY 7 % 2
       STOP RUN.
