       IDENTIFICATION DIVISION.
       PROGRAM-ID. MIN_MAX_BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       PERFORM FN_MIN USING NUMS
       DISPLAY FN_MIN_RES
       PERFORM FN_MAX USING NUMS
       DISPLAY FN_MAX_RES
       STOP RUN.
