       PERFORM FN_ADD USING 5
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARTIAL_APPLICATION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FN-ADD-RES PIC 9 VALUE 0.
       01 ADD5 PIC 9.
       01 TMP PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       COMPUTE ADD5 = FN_ADD_RES
       PERFORM FN_ADD5 USING 3
       DISPLAY FN_ADD5_RES
       STOP RUN.
       
       FN_ADD.
           PROCEDURE DIVISION USING A B.
               COMPUTE FN_ADD_RES = A + B
               EXIT.
