       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRINT_HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY "hello"
       STOP RUN.
