       IDENTIFICATION DIVISION.
       PROGRAM-ID. PURE_GLOBAL_FOLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 K PIC 9 VALUE 2.
       01 FN_INC_RES PIC 9 VALUE 0.
       01 TMP PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       PERFORM FN_INC USING 3
       DISPLAY FN_INC_RES
       STOP RUN.
       
       FN_INC.
           PROCEDURE DIVISION USING X.
               COMPUTE FN_INC_RES = X + K
               EXIT.
