       IDENTIFICATION DIVISION.
       PROGRAM-ID. STR_BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY 123
       STOP RUN.
