       IDENTIFICATION DIVISION.
       PROGRAM-ID. STR_BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY "123"
       STOP RUN.
