       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRING-CONCAT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY FUNCTION CONCATENATE("hello ", "world")
       STOP RUN.
