       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRING-IN-OPERATOR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 S PIC X(5) VALUE "catch".
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       COMPUTE TMP = FUNCTION INDEX(S, "cat") > 0
       DISPLAY TMP
       COMPUTE TMP = FUNCTION INDEX(S, "dog") > 0
       DISPLAY TMP
       STOP RUN.
