       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBSTRING_BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY "och"
       STOP RUN.
