       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBSTRING_BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY "och"
       STOP RUN.
