       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBSTRING_BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       PERFORM SUBSTRING USING "mochi" 1 4
       DISPLAY SUBSTRING_RES
       STOP RUN.
