       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUM-BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY 6
       STOP RUN.
