       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUM_BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY 6
       STOP RUN.
