       IDENTIFICATION DIVISION.
       PROGRAM-ID. TYPED_VAR.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY X
       STOP RUN.
