       IDENTIFICATION DIVISION.
       PROGRAM-ID. TYPED_LET.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 Y PIC 9 VALUE 0.
       PROCEDURE DIVISION.
       DISPLAY Y
       STOP RUN.
