       IDENTIFICATION DIVISION.
       PROGRAM-ID. UNARY_NEG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY - 3
       DISPLAY 5 + (- 2)
       STOP RUN.
