       IDENTIFICATION DIVISION.
       PROGRAM-ID. USER-TYPE-LITERAL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 BOOK.
           05 TITLE-V PIC X(2) VALUE "Go".
           05 AUTHOR-NAME PIC X(3) VALUE "Bob".
           05 AUTHOR-AGE PIC 9 VALUE 42.
       PROCEDURE DIVISION.
       DISPLAY AUTHOR-NAME
       STOP RUN.
