       IDENTIFICATION DIVISION.
       PROGRAM-ID. VALUES-BUILTIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TMP PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
       PERFORM FN_VALUES USING M
       DISPLAY FN_VALUES_RES
       STOP RUN.
