       IDENTIFICATION DIVISION.
       PROGRAM-ID. VAR_ASSIGNMENT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 X PIC 9 VALUE 1.
       PROCEDURE DIVISION.
       COMPUTE X = 2
       DISPLAY X
       STOP RUN.
