>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (25.0µs)"
    DISPLAY "   test example 2                      ... ok (794ns)"
    DISPLAY "   test single char                    ... ok (229ns)"
    DISPLAY "   test two chars                      ... ok (429ns)"
    STOP RUN.
