>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (2.0µs)"
    DISPLAY "   test example 2                      ... ok (1.0µs)"
    DISPLAY "   test single char                    ... ok (157ns)"
    DISPLAY "   test two chars                      ... ok (539ns)"
    STOP RUN.
