>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (13.0µs)"
    DISPLAY "   test example 2                      ... ok (825ns)"
    DISPLAY "   test example 3                      ... ok (41.0µs)"
    STOP RUN.
