>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (3.0µs)"
    DISPLAY "   test example 2                      ... ok (962ns)"
    DISPLAY "   test example 3                      ... ok (18.0µs)"
    STOP RUN.
