>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.
PROCEDURE DIVISION.
    DISPLAY "test example 1                      ... ok (7.0µs)"
    DISPLAY "   test example 2                      ... ok (793ns)"
    DISPLAY "   test example 3                      ... ok (25.0µs)"
    STOP RUN.
