================================================================================
vanilla sigil `()`
================================================================================

f() -> ~(foo).

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
vanilla sigil `[]`
================================================================================

f() -> ~[foo].

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
vanilla sigil `{}`
================================================================================

f() -> ~{foo}.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
vanilla sigil `<>`
================================================================================

f() -> ~<foo>.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))

================================================================================
vanilla sigil `<>` as param
================================================================================

f(~<foo>) -> ok.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args
        (string))
      (clause_body
        (atom)))))

================================================================================
vanilla sigil `/`
================================================================================

f() -> ~/foo/.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
vanilla sigil `|`
================================================================================

f() -> ~|foo|.


--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
vanilla sigil `'`
================================================================================

f() -> ~'foo'.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
vanilla sigil `"`
================================================================================

f() -> ~"foo".

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
vanilla sigil backtick
================================================================================

f() -> ~`foo`.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
vanilla sigil `#`
================================================================================

f() -> ~#foo#.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
verbatim sigil `()`
================================================================================

f() -> ~S(foo).

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
verbatim sigil `[]`
================================================================================

f() -> ~S[foo].

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
verbatim sigil `{}`
================================================================================

f() -> ~S{foo}.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
verbatim sigil `<>`
================================================================================

f() -> ~S<foo>.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
verbatim sigil `<>` as param
================================================================================

f(~S<foo>) -> ok.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args
        (string))
      (clause_body
        (atom)))))


================================================================================
verbatim sigil `/`
================================================================================

f() -> ~S/foo/.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
verbatim sigil `|`
================================================================================

f() -> ~S|foo|.


--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
verbatim sigil `'`
================================================================================

f() -> ~S'foo'.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
verbatim sigil `"`
================================================================================

f() -> ~S"foo".

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
verbatim sigil backtick
================================================================================

f() -> ~S`foo`.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
verbatim sigil `#`
================================================================================

f() -> ~S#foo#.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))

================================================================================
quoted sigil `()`
================================================================================

f() -> ~b(foo).

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
quoted sigil `[]`
================================================================================

f() -> ~b[foo].

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
quoted sigil `{}`
================================================================================

f() -> ~b{foo}.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
quoted sigil `<>`
================================================================================

f() -> ~b<foo>.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))

================================================================================
quoted sigil `<>` as param
================================================================================

f(~b<foo>) -> ok.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args
        (string))
      (clause_body
        (atom)))))

================================================================================
quoted sigil `/`
================================================================================

f() -> ~b/foo/.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
quoted sigil `|`
================================================================================

f() -> ~b|foo|.


--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
quoted sigil `'`
================================================================================

f() -> ~b'foo'.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
quoted sigil `"`
================================================================================

f() -> ~b"foo".

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
quoted sigil backtick
================================================================================

f() -> ~b`foo`.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))


================================================================================
quoted sigil `#`
================================================================================

f() -> ~b#foo#.

--------------------------------------------------------------------------------

(source_file
  (fun_decl
    (function_clause
      (atom)
      (expr_args)
      (clause_body
        (string)))))
